/* REXX */
PARSE ARG CMD
CONNAME = SPACE(CON TIME(S),0)
"CONSOLE ACTIVATE NAME("CONNAME")"
"CONSPROF UNSOLDISP(NO) SOLDISP(NO) SOLNUM(400)"
SAY "ISSUING "CMD
"CONSOLE SYSCMD("CMD") CART('CONS0001')"
GETCODE = GETMSG('CONSMSG1.','SOL','CONS0001',,15)
IF GETCODE = 0 THEN
  DO CNT = 1 TO CONSMSG1.0
    SAY CONSMSG1.CNT
  END
GETCODE = GETMSG('CONSMSG2.','SOL','',,5)
IF GETCODE = 0 THEN
  DO CNT = 1 TO CONSMSG2.0
    SAY CONSMSG2.CNT
  END
"CONSOLE DEACTIVATE"
EXIT 0
