       IDENTIFICATION DIVISION.
       PROGRAM-ID. COB02

       PROCEDURE DIVISION.
       MAIN SECTION.
           DISPLAY 'HELLO WORLD 2'
           .
       MAIN-END.
           GOBACK.

       END PROGRAM COB02.