//YBTKSA   JOB 'BLAAT',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID                        
//*                                                                             
//      EXPORT SYMLIST=*                                                        
//         SET LWZMHLQ=LWZM020.MASTER                                           
//      JCLLIB ORDER=(&LWZMHLQ..JCL)                                            
